In [ ]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.1 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [1]:
%load_ext sql

In [9]:
%%sql
export DATABASE_URL="postgresql://username:password@hostname/dbname"

Traceback (most recent call last):
  File "/usr/local/lib/python3.10/dist-packages/sql/magic.py", line 196, in execute
    conn = sql.connection.Connection.set(
  File "/usr/local/lib/python3.10/dist-packages/sql/connection.py", line 82, in set
    raise ConnectionError(
sql.connection.ConnectionError: Environment variable $DATABASE_URL not set, and no connect string given.

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [2]:
%%sql
-- Employee Table
CREATE TABLE Employee (
    ID INT PRIMARY KEY,
    name VARCHAR(255),
    office_number INT,
    age INT,
    floor_number INT CHECK (floor_number BETWEEN 1 AND 10),
    phone_number VARCHAR(15),
    email_address VARCHAR(255),
    address VARCHAR(255)
);
INSERT INTO Employee (ID, name, office_number, age, floor_number, phone_number, email_address, address) VALUES (1, 'John Doe', 101, 30, 1, '555-0101', 'john.doe@email.com', '123 Elm St');
INSERT INTO Employee (ID, name, office_number, age, floor_number, phone_number, email_address, address) VALUES (2, 'Jane Smith', 102, 25, 2, '555-0102', 'jane.smith@email.com', '124 Elm St');
INSERT INTO Employee (ID, name, office_number, age, floor_number, phone_number, email_address, address) VALUES (3, 'Alice Johnson', 103, 28, 3, '555-0103', 'alice.johnson@email.com', '125 Elm St');
INSERT INTO Employee (ID, name, office_number, age, floor_number, phone_number, email_address, address) VALUES (4, 'Bob Brown', 104, 40, 4, '555-0104', 'bob.brown@email.com', '126 Elm St');
INSERT INTO Employee (ID, name, office_number, age, floor_number, phone_number, email_address, address) VALUES (5, 'Charlie Davis', 105, 22, 5, '555-0105', 'charlie.davis@email.com', '127 Elm St');
INSERT INTO Employee (ID, name, office_number, age, floor_number, phone_number, email_address, address) VALUES (6, 'Daisy White', 106, 31, 6, '555-0106', 'daisy.white@email.com', '128 Elm St');
INSERT INTO Employee (ID, name, office_number, age, floor_number, phone_number, email_address, address) VALUES (7, 'Edward Taylor', 107, 27, 7, '555-0107', 'edward.taylor@email.com', '129 Elm St');
INSERT INTO Employee (ID, name, office_number, age, floor_number, phone_number, email_address, address) VALUES (8, 'Fiona Green', 108, 29, 8, '555-0108', 'fiona.green@email.com', '130 Elm St');
INSERT INTO Employee (ID, name, office_number, age, floor_number, phone_number, email_address, address) VALUES (9, 'George Harris', 109, 35, 9, '555-0109', 'george.harris@email.com', '131 Elm St');
INSERT INTO Employee (ID, name, office_number, age, floor_number, phone_number, email_address, address) VALUES (10, 'Hannah Martin', 110, 26, 10, '555-0110', 'hannah.martin@email.com', '132 Elm St');
INSERT INTO Employee (ID, name, office_number, age, floor_number, phone_number, email_address, address) VALUES (11, 'Ivan Thompson', 111, 33, 1, '555-0111', 'ivan.thompson@email.com', '133 Elm St');
INSERT INTO Employee (ID, name, office_number, age, floor_number, phone_number, email_address, address) VALUES (12, 'Jenny Clark', 112, 29, 2, '555-0112', 'jenny.clark@email.com', '134 Elm St');
INSERT INTO Employee (ID, name, office_number, age, floor_number, phone_number, email_address, address) VALUES (13, 'Kevin Rodriguez', 113, 37, 3, '555-0113', 'kevin.rodriguez@email.com', '135 Elm St');
INSERT INTO Employee (ID, name, office_number, age, floor_number, phone_number, email_address, address) VALUES (14, 'Lucy Moore', 114, 24, 1, '555-0114', 'lucy.moore@email.com', '136 Elm St');
INSERT INTO Employee (ID, name, office_number, age, floor_number, phone_number, email_address, address) VALUES (15, 'Mark Wilson', 115, 32, 5, '555-0115', 'mark.wilson@email.com', '137 Elm St');

select * from Employee;

-- Meeting Table
CREATE TABLE Meeting (
    meeting_ID INT PRIMARY KEY,
    employee_ID INT REFERENCES Employee(ID),
    room_number INT,
    floor_number INT CHECK (floor_number BETWEEN 1 AND 10),
    meeting_start_time INT CHECK (meeting_start_time BETWEEN 8 AND 18)
);

INSERT INTO Meeting (meeting_ID, employee_ID, room_number, floor_number, meeting_start_time) VALUES (1, 1, 301, 3, 9);
INSERT INTO Meeting (meeting_ID, employee_ID, room_number, floor_number, meeting_start_time) VALUES (2, 2, 302, 3, 10);
INSERT INTO Meeting (meeting_ID, employee_ID, room_number, floor_number, meeting_start_time) VALUES (3, 3, 303, 3, 11);
INSERT INTO Meeting (meeting_ID, employee_ID, room_number, floor_number, meeting_start_time) VALUES (4, 4, 301, 3, 14);
INSERT INTO Meeting (meeting_ID, employee_ID, room_number, floor_number, meeting_start_time) VALUES (5, 5, 304, 3, 8);
INSERT INTO Meeting (meeting_ID, employee_ID, room_number, floor_number, meeting_start_time) VALUES (6, 6, 305, 3, 15);
INSERT INTO Meeting (meeting_ID, employee_ID, room_number, floor_number, meeting_start_time) VALUES (7, 7, 306, 3, 12);
INSERT INTO Meeting (meeting_ID, employee_ID, room_number, floor_number, meeting_start_time) VALUES (8, 8, 302, 3, 16);
INSERT INTO Meeting (meeting_ID, employee_ID, room_number, floor_number, meeting_start_time) VALUES (9, 9, 307, 3, 17);
INSERT INTO Meeting (meeting_ID, employee_ID, room_number, floor_number, meeting_start_time) VALUES (10, 10, 308, 3, 18);
INSERT INTO Meeting (meeting_ID, employee_ID, room_number, floor_number, meeting_start_time) VALUES (11, 11, 309, 3, 13);
INSERT INTO Meeting (meeting_ID, employee_ID, room_number, floor_number, meeting_start_time) VALUES (12, 12, 301, 3, 9);
INSERT INTO Meeting (meeting_ID, employee_ID, room_number, floor_number, meeting_start_time) VALUES (13, 13, 310, 3, 8);
INSERT INTO Meeting (meeting_ID, employee_ID, room_number, floor_number, meeting_start_time) VALUES (14, 14, 311, 3, 14);
INSERT INTO Meeting (meeting_ID, employee_ID, room_number, floor_number, meeting_start_time) VALUES (15, 15, 312, 3, 10);

select * from Meeting;

-- Notification Table
CREATE TABLE Notification (
    notification_ID INT PRIMARY KEY,
    employee_ID INT REFERENCES Employee(ID),
    notification_date DATE,
    notification_type VARCHAR(10) CHECK (notification_type IN ('mandatory', 'optional'))
);

INSERT INTO Notification (notification_ID, employee_ID, notification_date, notification_type) VALUES (1, 1, TO_DATE ('2023-10-01', 'YYYY-MM-DD'), 'mandatory');
INSERT INTO Notification (notification_ID, employee_ID, notification_date, notification_type) VALUES (2, 2, TO_DATE ('2023-10-02', 'YYYY-MM-DD'),'optional');
INSERT INTO Notification (notification_ID, employee_ID, notification_date, notification_type) VALUES (3, 3, TO_DATE ('2023-10-03', 'YYYY-MM-DD'),'mandatory');
INSERT INTO Notification (notification_ID, employee_ID, notification_date, notification_type) VALUES (4, 4, TO_DATE ('2023-10-04', 'YYYY-MM-DD'),'optional');
INSERT INTO Notification (notification_ID, employee_ID, notification_date, notification_type) VALUES (5, 5, TO_DATE ('2023-10-05','YYYY-MM-DD'),'mandatory');
INSERT INTO Notification (notification_ID, employee_ID, notification_date, notification_type) VALUES (6, 6, TO_DATE ('2023-10-06','YYYY-MM-DD'), 'optional');
INSERT INTO Notification (notification_ID, employee_ID, notification_date, notification_type) VALUES (7, 7, TO_DATE ('2023-10-07', 'YYYY-MM-DD'),'mandatory');
INSERT INTO Notification (notification_ID, employee_ID, notification_date, notification_type) VALUES (8, 8, TO_DATE ('2023-10-08', 'YYYY-MM-DD'),'optional');
INSERT INTO Notification (notification_ID, employee_ID, notification_date, notification_type) VALUES (9, 9, TO_DATE ('2023-10-09', 'YYYY-MM-DD'),'mandatory');
INSERT INTO Notification (notification_ID, employee_ID, notification_date, notification_type) VALUES (10, 10, TO_DATE ('2023-10-10','YYYY-MM-DD'), 'optional');
INSERT INTO Notification (notification_ID, employee_ID, notification_date, notification_type) VALUES (11, 11, TO_DATE ('2023-10-11','YYYY-MM-DD'), 'mandatory');
INSERT INTO Notification (notification_ID, employee_ID, notification_date, notification_type) VALUES (12, 12, TO_DATE ('2023-10-12','YYYY-MM-DD'), 'optional');
INSERT INTO Notification (notification_ID, employee_ID, notification_date, notification_type) VALUES (13, 13, TO_DATE ('2023-10-13','YYYY-MM-DD'), 'mandatory');
INSERT INTO Notification (notification_ID, employee_ID, notification_date, notification_type) VALUES (14, 14, TO_DATE ('2023-10-14','YYYY-MM-DD'),'optional');
INSERT INTO Notification (notification_ID, employee_ID, notification_date, notification_type) VALUES (15, 15, TO_DATE ('2023-10-15','YYYY-MM-DD'), 'mandatory');

select * from Notification ;

-- Symptom Table
CREATE TABLE Symptom (
    row_ID INT PRIMARY KEY,
    employee_ID INT REFERENCES Employee(ID),
    date_reported DATE,
    symptom_ID INT CHECK (symptom_ID BETWEEN 1 AND 5)
);

INSERT INTO Symptom (row_ID, employee_ID, date_reported, symptom_ID) VALUES (1, 1, TO_DATE ('2023-10-01','YYYY-MM-DD'),1);
INSERT INTO Symptom (row_ID, employee_ID, date_reported, symptom_ID) VALUES (2, 2, TO_DATE ('2023-10-01','YYYY-MM-DD'),2);
INSERT INTO Symptom (row_ID, employee_ID, date_reported, symptom_ID) VALUES (3, 3, TO_DATE ('2023-10-02','YYYY-MM-DD'),3);
INSERT INTO Symptom (row_ID, employee_ID, date_reported, symptom_ID) VALUES (4, 4, TO_DATE ('2023-10-02','YYYY-MM-DD'),4);
INSERT INTO Symptom (row_ID, employee_ID, date_reported, symptom_ID) VALUES (5, 5, TO_DATE ('2023-10-03','YYYY-MM-DD'),5);
INSERT INTO Symptom (row_ID, employee_ID, date_reported, symptom_ID) VALUES (6, 6, TO_DATE ('2023-10-03','YYYY-MM-DD'),1);
INSERT INTO Symptom (row_ID, employee_ID, date_reported, symptom_ID) VALUES (7, 7, TO_DATE ('2023-10-04','YYYY-MM-DD'),2);
INSERT INTO Symptom (row_ID, employee_ID, date_reported, symptom_ID) VALUES (8, 8, TO_DATE ('2023-10-04','YYYY-MM-DD'),3);
INSERT INTO Symptom (row_ID, employee_ID, date_reported, symptom_ID) VALUES (9, 9, TO_DATE ('2023-10-05', 'YYYY-MM-DD'),4);
INSERT INTO Symptom (row_ID, employee_ID, date_reported, symptom_ID) VALUES (10, 10, TO_DATE ('2023-10-05','YYYY-MM-DD'),5);
INSERT INTO Symptom (row_ID, employee_ID, date_reported, symptom_ID) VALUES (11, 11, TO_DATE ('2023-10-06','YYYY-MM-DD'),1);
INSERT INTO Symptom (row_ID, employee_ID, date_reported, symptom_ID) VALUES (12, 12, TO_DATE ('2023-10-06','YYYY-MM-DD'),2);
INSERT INTO Symptom (row_ID, employee_ID, date_reported, symptom_ID) VALUES (13, 13, TO_DATE ('2023-10-07','YYYY-MM-DD'),3);
INSERT INTO Symptom (row_ID, employee_ID, date_reported, symptom_ID) VALUES (14, 14, TO_DATE ('2023-10-07','YYYY-MM-DD'),4);
INSERT INTO Symptom (row_ID, employee_ID, date_reported, symptom_ID) VALUES (15, 15, TO_DATE ('2023-10-08','YYYY-MM-DD'),5);

select * from Symptom ;

-- Scan Table
CREATE TABLE Scan (
    scan_ID INT PRIMARY KEY,
    scan_date DATE,
    scan_time INT CHECK (scan_time BETWEEN 0 AND 23),
    employee_ID INT REFERENCES Employee(ID),
    temperature FLOAT
);

INSERT INTO Scan (scan_ID, scan_date, scan_time, employee_ID, temperature) VALUES (1, TO_DATE ('2023-10-01','YYYY-MM-DD'),9, 1, 98.6);
INSERT INTO Scan (scan_ID, scan_date, scan_time, employee_ID, temperature) VALUES (2, TO_DATE ('2023-10-01','YYYY-MM-DD'),10, 2, 99.5);
INSERT INTO Scan (scan_ID, scan_date, scan_time, employee_ID, temperature) VALUES (3, TO_DATE ('2023-10-02','YYYY-MM-DD'),11, 3, 98.4);
INSERT INTO Scan (scan_ID, scan_date, scan_time, employee_ID, temperature) VALUES (4, TO_DATE ('2023-10-02','YYYY-MM-DD'),14, 4, 101.1);
INSERT INTO Scan (scan_ID, scan_date, scan_time, employee_ID, temperature) VALUES (5, TO_DATE ('2023-10-03','YYYY-MM-DD'),8, 5, 98.6);
INSERT INTO Scan (scan_ID, scan_date, scan_time, employee_ID, temperature) VALUES (6, TO_DATE ('2023-10-03','YYYY-MM-DD'),16, 6, 98.7);
INSERT INTO Scan (scan_ID, scan_date, scan_time, employee_ID, temperature) VALUES (7, TO_DATE ('2023-10-04','YYYY-MM-DD'),12, 7, 98.9);
INSERT INTO Scan (scan_ID, scan_date, scan_time, employee_ID, temperature) VALUES (8, TO_DATE ('2023-10-04','YYYY-MM-DD'),15, 8, 102.2);
INSERT INTO Scan (scan_ID, scan_date, scan_time, employee_ID, temperature) VALUES (9, TO_DATE ('2023-10-05','YYYY-MM-DD'),9, 9, 98.5);
INSERT INTO Scan (scan_ID, scan_date, scan_time, employee_ID, temperature) VALUES (10, TO_DATE ('2023-10-05','YYYY-MM-DD'),17, 10, 99.8);
INSERT INTO Scan (scan_ID, scan_date, scan_time, employee_ID, temperature) VALUES (11, TO_DATE ('2023-10-06','YYYY-MM-DD'),10, 11, 98.3);
INSERT INTO Scan (scan_ID, scan_date, scan_time, employee_ID, temperature) VALUES (12, TO_DATE ('2023-10-06','YYYY-MM-DD'),11, 12, 100.5);
INSERT INTO Scan (scan_ID, scan_date, scan_time, employee_ID, temperature) VALUES (13, TO_DATE ('2023-10-07','YYYY-MM-DD'),14, 13, 98.8);
INSERT INTO Scan (scan_ID, scan_date, scan_time, employee_ID, temperature) VALUES (14, TO_DATE ('2023-10-07','YYYY-MM-DD'),15, 14, 101.4);
INSERT INTO Scan (scan_ID, scan_date, scan_time, employee_ID, temperature) VALUES (15, TO_DATE ('2023-10-08','YYYY-MM-DD'),9, 15, 98.7);

select * from Scan ;

-- Test Table
CREATE TABLE Test (
    test_ID INT PRIMARY KEY,
    location VARCHAR(50) CHECK (location IN ('company', 'hospital', 'clinic')),
    test_date DATE,
    test_time INT CHECK (test_time BETWEEN 0 AND 23),
    employee_ID INT REFERENCES Employee(ID),
    test_result VARCHAR(10) CHECK (test_result IN ('positive', 'negative'))
);

INSERT INTO Test (test_ID, location, test_date, test_time, employee_ID, test_result) VALUES (1, 'company', TO_DATE ('2023-10-01', 'YYYY-MM-DD') ,10, 1, 'negative');
INSERT INTO Test (test_ID, location, test_date, test_time, employee_ID, test_result) VALUES (2, 'hospital', TO_DATE ('2023-10-01', 'YYYY-MM-DD'),11, 2, 'positive');
INSERT INTO Test (test_ID, location, test_date, test_time, employee_ID, test_result) VALUES (3, 'clinic', TO_DATE ('2023-10-02','YYYY-MM-DD'), 14, 3, 'negative');
INSERT INTO Test (test_ID, location, test_date, test_time, employee_ID, test_result) VALUES (4, 'company', TO_DATE ('2023-10-02','YYYY-MM-DD'), 15, 4, 'negative');
INSERT INTO Test (test_ID, location, test_date, test_time, employee_ID, test_result) VALUES (5, 'hospital', TO_DATE ('2023-10-03','YYYY-MM-DD'), 9, 5, 'positive');
INSERT INTO Test (test_ID, location, test_date, test_time, employee_ID, test_result) VALUES (6, 'clinic', TO_DATE ('2023-10-03','YYYY-MM-DD'), 16, 6, 'negative');
INSERT INTO Test (test_ID, location, test_date, test_time, employee_ID, test_result) VALUES (7, 'company', TO_DATE ('2023-10-04','YYYY-MM-DD'), 12, 7, 'negative');
INSERT INTO Test (test_ID, location, test_date, test_time, employee_ID, test_result) VALUES (8, 'hospital', TO_DATE ('2023-10-04','YYYY-MM-DD'), 14, 8, 'positive');
INSERT INTO Test (test_ID, location, test_date, test_time, employee_ID, test_result) VALUES (9, 'clinic', TO_DATE ('2023-10-05','YYYY-MM-DD'), 10, 9, 'negative');
INSERT INTO Test (test_ID, location, test_date, test_time, employee_ID, test_result) VALUES (10, 'company', TO_DATE ('2023-10-05','YYYY-MM-DD'),11, 10, 'negative');
INSERT INTO Test (test_ID, location, test_date, test_time, employee_ID, test_result) VALUES (11, 'hospital', TO_DATE ('2023-10-06','YYYY-MM-DD'), 13, 11, 'positive');
INSERT INTO Test (test_ID, location, test_date, test_time, employee_ID, test_result) VALUES (12, 'clinic', TO_DATE ('2023-10-06','YYYY-MM-DD'), 14, 12, 'negative');
INSERT INTO Test (test_ID, location, test_date, test_time, employee_ID, test_result) VALUES (13, 'company', TO_DATE ('2023-10-07','YYYY-MM-DD'), 15, 13, 'negative');
INSERT INTO Test (test_ID, location, test_date, test_time, employee_ID, test_result) VALUES (14, 'hospital', TO_DATE ('2023-10-07','YYYY-MM-DD'), 16, 14, 'positive');
INSERT INTO Test (test_ID, location, test_date, test_time, employee_ID, test_result) VALUES (15, 'clinic', TO_DATE ('2023-10-08','YYYY-MM-DD'), 9, 15, 'negative');

select * from Test ;

-- Case Table
CREATE TABLE "Case" (
    case_ID INT PRIMARY KEY,
    employee_ID INT REFERENCES Employee(ID),
    "date" DATE,
    resolution VARCHAR(50) CHECK (resolution IN ('back to work', 'left the company', 'deceased'))
);

INSERT INTO "Case" (case_ID, employee_ID, "date", resolution) VALUES (1, 1, TO_DATE ('2023-10-01','YYYY-MM-DD') ,'back to work');
INSERT INTO "Case" (case_ID, employee_ID, "date", resolution) VALUES (2, 2, TO_DATE ('2023-10-02', 'YYYY-MM-DD'),'left the company');
INSERT INTO "Case" (case_ID, employee_ID, "date", resolution) VALUES (3, 3, TO_DATE ('2023-10-03','YYYY-MM-DD') ,'back to work');
INSERT INTO "Case" (case_ID, employee_ID, "date", resolution) VALUES (4, 4, TO_DATE ('2023-10-04','YYYY-MM-DD'),'deceased');
INSERT INTO "Case" (case_ID, employee_ID, "date", resolution) VALUES (5, 5, TO_DATE ('2023-10-05','YYYY-MM-DD'),'back to work');
INSERT INTO "Case" (case_ID, employee_ID, "date", resolution) VALUES (6, 6, TO_DATE ('2023-10-06','YYYY-MM-DD'), 'left the company');
INSERT INTO "Case" (case_ID, employee_ID, "date", resolution) VALUES (7, 7, TO_DATE ('2023-10-07','YYYY-MM-DD'), 'back to work');
INSERT INTO "Case" (case_ID, employee_ID, "date", resolution) VALUES (8, 8, TO_DATE ('2023-10-08','YYYY-MM-DD'), 'left the company');
INSERT INTO "Case" (case_ID, employee_ID, "date", resolution) VALUES (9, 9, TO_DATE ('2023-10-09', 'YYYY-MM-DD'),'back to work');
INSERT INTO "Case" (case_ID, employee_ID, "date", resolution) VALUES (10, 10, TO_DATE ('2023-10-10','YYYY-MM-DD'), 'deceased');
INSERT INTO "Case" (case_ID, employee_ID, "date", resolution) VALUES (11, 11, TO_DATE ('2023-10-11','YYYY-MM-DD'), 'back to work');
INSERT INTO "Case" (case_ID, employee_ID, "date", resolution) VALUES (12, 12, TO_DATE ('2023-10-12','YYYY-MM-DD'), 'left the company');
INSERT INTO "Case" (case_ID, employee_ID, "date", resolution) VALUES (13, 13, TO_DATE ('2023-10-13','YYYY-MM-DD'), 'back to work');
INSERT INTO "Case" (case_ID, employee_ID, "date", resolution) VALUES (14, 14, TO_DATE ('2023-10-14','YYYY-MM-DD'), 'deceased');
INSERT INTO "Case" (case_ID, employee_ID, "date", resolution) VALUES (15, 15, TO_DATE ('2023-10-15','YYYY-MM-DD'),'back to work');

select * from "Case" ;


-- HealthStatus Table
CREATE TABLE HealthStatus (
    row_ID INT PRIMARY KEY,
    employee_ID INT REFERENCES Employee(ID),
    "date" DATE,
    status VARCHAR(15) CHECK (status IN ('sick', 'hospitalized', 'well'))
);

INSERT INTO HealthStatus (row_ID, employee_ID, "date", status) VALUES (1, 1, TO_DATE ('2023-10-01', 'YYYY-MM-DD'),'sick');
INSERT INTO HealthStatus (row_ID, employee_ID, "date", status) VALUES (2, 2, TO_DATE ('2023-10-02','YYYY-MM-DD') ,'well');
INSERT INTO HealthStatus (row_ID, employee_ID, "date", status) VALUES (3, 3, TO_DATE ('2023-10-03','YYYY-MM-DD') ,'hospitalized');
INSERT INTO HealthStatus (row_ID, employee_ID, "date", status) VALUES (4, 4, TO_DATE ('2023-10-04','YYYY-MM-DD') ,'sick');
INSERT INTO HealthStatus (row_ID, employee_ID, "date", status) VALUES (5, 5, TO_DATE ('2023-10-05','YYYY-MM-DD') ,'well');
INSERT INTO HealthStatus (row_ID, employee_ID, "date", status) VALUES (6, 6, TO_DATE ('2023-10-06','YYYY-MM-DD') ,'hospitalized');
INSERT INTO HealthStatus (row_ID, employee_ID, "date", status) VALUES (7, 7, TO_DATE ('2023-10-07', 'YYYY-MM-DD'),'sick');
INSERT INTO HealthStatus (row_ID, employee_ID, "date", status) VALUES (8, 8, TO_DATE ('2023-10-08', 'YYYY-MM-DD'),'well');
INSERT INTO HealthStatus (row_ID, employee_ID, "date", status) VALUES (9, 9, TO_DATE ('2023-10-09','YYYY-MM-DD'), 'hospitalized');
INSERT INTO HealthStatus (row_ID, employee_ID, "date", status) VALUES (10, 10, TO_DATE ('2023-10-10','YYYY-MM-DD'), 'sick');
INSERT INTO HealthStatus (row_ID, employee_ID, "date", status) VALUES (11, 11, TO_DATE ('2023-10-11','YYYY-MM-DD'), 'sick');
INSERT INTO HealthStatus (row_ID, employee_ID, "date", status) VALUES (12, 12, TO_DATE ('2023-10-12','YYYY-MM-DD') ,'hospitalized');
INSERT INTO HealthStatus (row_ID, employee_ID, "date", status) VALUES (13, 13, TO_DATE ('2023-10-13', 'YYYY-MM-DD'),'sick');
INSERT INTO HealthStatus (row_ID, employee_ID, "date", status) VALUES (14, 14, TO_DATE ('2023-10-14', 'YYYY-MM-DD'),'sick');
INSERT INTO HealthStatus (row_ID, employee_ID, "date", status) VALUES (15, 15, TO_DATE ('2023-10-15','YYYY-MM-DD'),'hospitalized');

select * from HealthStatus ;

SELECT floor_number, COUNT(*) as count
FROM Employee e
JOIN HealthStatus hs ON e.ID = hs.employee_ID
WHERE hs.status = 'sick'
GROUP BY floor_number
ORDER BY count DESC
FETCH FIRST 1 ROWS ONLY;

SELECT COUNT(*) AS "Number of Scans"
FROM Scan
WHERE scan_date BETWEEN TO_DATE('2023-10-1', 'YYYY-MM-DD') AND TO_DATE('2023-10-07', 'YYYY-MM-DD');

SELECT COUNT(*) AS "Number of Tests"
FROM Test
WHERE test_date BETWEEN TO_DATE('2023-10-01', 'YYYY-MM-DD') AND TO_DATE('2023-10-06', 'YYYY-MM-DD');

SELECT COUNT(DISTINCT employee_ID) AS "Number of Employees Reported Symptoms"
FROM Symptom
WHERE date_reported BETWEEN TO_DATE('2023-10-01', 'YYYY-MM-DD') AND TO_DATE('2023-10-09', 'YYYY-MM-DD');

SELECT COUNT(*) AS "Number of Positive Cases"
FROM Test
WHERE test_date BETWEEN TO_DATE('2023-10-01', 'YYYY-MM-DD') AND TO_DATE('2023-10-15', 'YYYY-MM-DD')
AND test_result = 'positive';

Traceback (most recent call last):
  File "/usr/local/lib/python3.10/dist-packages/sql/magic.py", line 196, in execute
    conn = sql.connection.Connection.set(
  File "/usr/local/lib/python3.10/dist-packages/sql/connection.py", line 82, in set
    raise ConnectionError(
sql.connection.ConnectionError: Environment variable $DATABASE_URL not set, and no connect string given.

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [ ]:
SELECT *
FROM EmployeeTestResults
WHERE EmployeeID NOT IN
(
    SELECT e.EmployeeID
    FROM EmployeeTestResults e
    JOIN TEST t ON e.TESTRESULT = t.test_result
    MINUS
    SELECT EmployeeID
    FROM EmployeeTestResults
);

In [ ]:
SELECT * FROM EmployeeTestResults;

SELECT * FROM EmployeeTestResults
WHERE EmployeeTestResults.EMPLOYEEID not in (SELECT EmployeeTestResults.EMPLOYEEID FROM (
SELECT EmployeeTestResults.EMPLOYEEID,EmployeeTestResults.TESTRESULT FROM( SELECT TESTRESULT FROM TEST) as p cross join
(select distinct  EmployeeTestResults from EmployeeTestResults ) as sp)
EXCEPT
(SELECT EmployeeTestResults.EMPLOYEEID, EmployeeTestResults.TESTRESULT FROM EmployeeTestResults ) AS r);

question 4

In [ ]:
SELECT COUNT(*) AS "Number of Scans"
FROM Scan
WHERE scan_date BETWEEN TO_DATE('2023-10-1', 'YYYY-MM-DD') AND TO_DATE('2023-10-07', 'YYYY-MM-DD');

SELECT COUNT(*) AS "Number of Tests"
FROM Test
WHERE test_date BETWEEN TO_DATE('2023-10-01', 'YYYY-MM-DD') AND TO_DATE('2023-10-06', 'YYYY-MM-DD');

SELECT COUNT(DISTINCT employee_ID) AS "Number of Employees Reported Symptoms"
FROM Symptom
WHERE date_reported BETWEEN TO_DATE('2023-10-01', 'YYYY-MM-DD') AND TO_DATE('2023-10-09', 'YYYY-MM-DD');

SELECT COUNT(*) AS "Number of Positive Cases"
FROM Test
WHERE test_date BETWEEN TO_DATE('2023-10-01', 'YYYY-MM-DD') AND TO_DATE('2023-10-15', 'YYYY-MM-DD')
AND test_result = 'positive';

In [ ]:
-- Number of scans
SELECT COUNT(*) FROM Scan WHERE scan_date BETWEEN TO_DATE('2023-01-01', 'YYYY-MM-DD') AND TO_DATE('2023-12-31', 'YYYY-MM-DD');

-- Number of tests
SELECT COUNT(*) FROM Test WHERE test_date BETWEEN TO_DATE('2023-01-01', 'YYYY-MM-DD') AND TO_DATE('2023-12-31', 'YYYY-MM-DD');

-- Number of employees who self-reported symptoms
SELECT COUNT(DISTINCT employee_ID) FROM Symptom WHERE date_reported BETWEEN TO_DATE('2023-01-01', 'YYYY-MM-DD') AND TO_DATE('2023-12-31', 'YYYY-MM-DD');

-- Number of positive cases
SELECT COUNT(*) FROM "Case" WHERE date BETWEEN TO_DATE('2023-01-01', 'YYYY-MM-DD') AND TO_DATE('2023-12-31', 'YYYY-MM-DD') AND test_result = 'positive';
SELECT symptom_ID, COUNT(*) as symptom_count
FROM Symptom
GROUP BY symptom_ID
ORDER BY symptom_count DESC
FETCH FIRST 1 ROWS ONLY;

In [ ]:
SELECT COUNT(*) AS "Number of Scans"
FROM Scan
WHERE scan_date BETWEEN TO_DATE('2023-10-01', 'YYYY-MM-DD') AND TO_DATE('2023-10-15', 'YYYY-MM-DD');

question 5

In [ ]:
Which employees have temperatures above 100°F on their scans?


SELECT e.ID, e.name
FROM Employee e
JOIN Scan s ON e.ID = s.employee_ID
WHERE s.temperature > 100.0;

In [ ]:
Which employees have temperatures above 100°F on their scans?


SELECT e.ID, e.name
FROM Employee e
JOIN Scan s ON e.ID = s.employee_ID
WHERE s.temperature > 100.0;

SELECT COUNT(*) AS "Number of Meetings After 3 PM"
FROM Meeting
WHERE meeting_start_time > 15;

SELECT e.ID, e.name
FROM Employee e
WHERE EXISTS (
    SELECT 1
    FROM Notification n
    WHERE n.employee_ID = e.ID AND n.notification_type = 'mandatory'
)
AND NOT EXISTS (
    SELECT 1
    FROM Meeting m
    WHERE m.employee_ID = e.ID
);

SELECT COUNT(DISTINCT e.ID) AS "Number of Employees"
FROM Employee e
JOIN HealthStatus hs1 ON e.ID = hs1.employee_ID AND hs1.status = 'hospitalized'
JOIN HealthStatus hs2 ON e.ID = hs2.employee_ID AND hs2.status = 'sick'
WHERE NOT EXISTS (
    SELECT 1
    FROM HealthStatus hs3
    WHERE hs3.employee_ID = e.ID AND hs3.status = 'well'
);

SELECT floor_number, COUNT(*) AS "Number of Meetings"
FROM Meeting
GROUP BY floor_number
ORDER BY "Number of Meetings" DESC
FETCH FIRST 1 ROWS ONLY;

In [ ]:
SELECT *
FROM EmployeeTestResults
WHERE EmployeeID NOT IN
(
    SELECT e.EmployeeID
    FROM EmployeeTestResults e
    JOIN TEST t ON e.location = t.location
    MINUS
    SELECT EmployeeID
    FROM EmployeeTestResults
);



SELECT * FROM EmployeeTestResults
WHERE EMPLOYEEID not in (SELECT EMPLOYEEID FROM (
(SELECT EMPLOYEEID,location FROM( SELECT location FROM TEST) as p cross join
(select distinct  EMPLOYEEID from EmployeeTestResults ) as sp)
EXCEPT
(SELECT EMPLOYEEID, location FROM EmployeeTestResults ) AS r);